actboy168.lua-debug
alexcvzz.vscode-sqlite
biomejs.biome
bradlc.vscode-tailwindcss
charliermarsh.ruff
codezombiech.gitignore
crystal-lang-tools.crystal-lang
csharpier.csharpier-vscode
dabbinavo.xamlstyler
davidwang.ini-for-vscode
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
fill-labs.dependi
github.vscode-github-actions
golang.go
hbenl.vscode-test-explorer
ibm.output-colorizer
jetbrains.resharper-code
joelharkes.eml-email-viewer
kdl-org.kdl
lfs.vscode-emacs-friendly
mattn.lisp
matthewpi.caddyfile-support
mechatroner.rainbow-csv
melishev.feather-vscode
ms-azuretools.vscode-containers
ms-dotnettools.csharp
ms-python.python
ms-vscode-remote.remote-containers
ms-vscode.cpptools-extension-pack
ms-vscode.makefile-tools
nabeelvalley.easyzoom
ocamllabs.ocaml-platform
pkief.material-icon-theme
redhat.vscode-yaml
romario-stankovic.insomnia-theme
rust-lang.rust-analyzer
simonsiefke.svg-preview
sukumo28.wav-preview
sumneko.lua
svelte.svelte-vscode
tamasfe.even-better-toml
thomas-fazzari.tokyonightcustom
tomoki1207.pdf
usernamehw.errorlens
veelenga.crystal-ameba
vitest.explorer
