# Restore with:
#   brew bundle --file ~/Dev/dotfiles/Brewfile

tap "tw93/tap"

# Core CLI
brew "bat"
brew "coreutils"
brew "curl"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "jq"
brew "just"
brew "ripgrep"
brew "sd"
brew "tokei"
brew "tree"
brew "yq"

# Dev tools
brew "ast-grep"
brew "biome"
brew "cmake"
brew "crystalline"
brew "difftastic"
brew "dotnet"
brew "golangci-lint"
brew "hyperfine"
brew "lua"
brew "nvm"
brew "opam"
brew "pnpm"
brew "rtk"
brew "tw93/tap/mole"
brew "uv"
brew "yaml-language-server"
brew "zig"

# Swift / Apple platforms
brew "swift-format"
brew "swiftformat"
brew "swiftlint"
brew "xcode-build-server"

# Media and files
brew "exiftool"
brew "ffmpeg"
brew "imagemagick"
brew "poppler"
brew "qpdf"
brew "xdelta"

# Databases
brew "postgresql@18"
cask "dbeaver-community"

# Applications
cask "alt-tab"
cask "bitwarden"
cask "codex"
cask "docker-desktop"
cask "helium-browser"
cask "keka"
cask "kitty"
cask "kid3"
cask "mullvad-vpn"
cask "onlyoffice"
cask "pearcleaner"
cask "proton-mail"
cask "transmission"
cask "visual-studio-code@insiders"

# Fonts
cask "font-0xproto-nerd-font"
